import logging
from core import Drawer


REGIONS = {
    'Псковская область',
    'Ленинградская область',
    'Московская область',
    'Смоленская область',
    'Тверская область',
    'Новгородская область',
    'Владимирская область',
    'Брянская область',
    'Рязанская область',
    'Тамбовская область',
    'Воронежская область',
    'Ростовская область',
    'Краснодарский край',
    'Ставропольский край',
    'Курская область',
    'Белгородская область',
    'Липецкая область',
    'Орловская область',
    'Ярославская область',
    'Волгоградская область',
    'Астраханская область',
    'Дагестан',
    'Калмыкия',
    'Ставропольский край',
    'Калужская область',
    'Тульская область',
    'Москва',
    'Адыгея',
}


# Запрос в гугл: координата <город> в десятичном формате

CITIES = [
    # Город,         lat,       lon,       интенсивность
    ('Великие Луки', 56.331832, 30.543955, 1),
    ('Кунья', 56.293137, 30.980253, 0.8),
    ('Двинь-Покровское', 56.155262, 31.171711, 0.8),
    ('Себеж', 56.289800, 28.473300, 0.6),
    ('Дно', 57.82728, 29.97684, 0.2),   
    ('Псков', 57.816667, 28.333333, 0.8),
    ('Смоленск', 54.7818, 32.0401, 0.6),
    ("Москва", 55.753960, 37.620393, 0.5),
    ('Ярославль', 57.626549, 39.893885, 0.3),
    ('Долгопрудный', 55.933302, 37.514230, 0.3),
    ('Александров', 56.393611, 38.715000, 0.2),
    ('Цудахар', 42.342297, 47.159289, 0.6),
    ('Санкт-Петербург', 59.939095, 30.315868, 0.5),
    ('Брянск', 53.2427, 34.3639, 0.4),
    ('Краснодар', 45.035470, 38.975313, 0.15),
]



if __name__ == '__main__':
    logging.basicConfig(level=logging.INFO)

    dr = Drawer(cities=CITIES, regions=REGIONS)

    dr.draw()

